{
	"about": {
		"myname": "Евгений Охватюк",
		"job": "Frontend разработчик"
	},
	"theme": {
		"lightTheme": "Светлая тема",
		"darkTheme": "Темная тема"
	},
	"pages": {
		"home": {
			"links": {
				"resume": "Мое резюме",
				"github": "Мой GitHub",
				"projects": "Мои проекты"
			},
			"welcome": {
				"p1": "Добро пожаловать на мой сайт! Меня зовут <b>Евгений Охватюк (псевдоним SBV)</b> и я занимаюсь web-разработкой уже более года. Мой основной стек технологий - это React. Я стараюсь создавать веб-приложения, которые были бы красивыми, удобными в использовании и максимально эффективными.",
				"p2": "На этом сайте я представляю свои работы и эксперименты в области web-разработки. Здесь вы можете ознакомиться с моими проектами и узнать больше о том, как я работаю.",
				"p3": "Будьте уверены, что на моем сайте не собирается никакой личной информации. Если у вас есть какие-либо вопросы, не стесняйтесь обращаться ко мне по электронной почте <b>ohvatuki@gmail.com</b>.",
				"p4": "Спасибо за посещение моего сайта, я надеюсь, что вы найдете здесь много интересного!"
			}
		},
		"resume": {
			"title": "Резюме",
			"content": {
				"p1": "Frontend разработчик с опытом веб-разработки более 1 года (некоммерческий опыт). Люблю разрабатывать красивые и адаптивные веб-сайты с использованием семантических тегов. Владею <b>HTML, CSS (также препроцессор SASS), JavaScript (включая синтаксис ES6)</b>. В последние пол года пишу приложения с использованием библиотек <b>React и Redux</b>. На данный момент изучаю <b>TypeScript</b>.",
				"p2": "Имею опыт написания серверной части приложений (API) с использованием <b>Node.js и фреймворка Express</b>. Обладаю некоторыми знаниями в <b>SQL</b>, а именно создание базы данных и выполнение SQL-запросов к ней (для своих целей использовал PostgreSQL). Список последних проектов можно увидеть в самом низу.",
				"p3": "В скором времени закончу учебу в колледже (4 курс) и надеюсь найти свою первую работу."
			}
		},
		"projects": {
			"title": "Проекты",
			"content": {}
		},
		"404": {
			"message": "Ошибка. Данной страницы не существует."
		}
	},
	"back-home": "Главная страница"
}
