{
	"version": "Версия",
	"about": {
		"myname": "Евгений Охватюк",
		"job": "Frontend разработчик"
	},
	"theme": {
		"lightTheme": "Светлая тема",
		"darkTheme": "Темная тема"
	},
	"pages": {
		"home": {
			"links": {
				"resume": "Резюме",
				"projects": "Проекты",
				"feedback": "Связь"
			},
			"welcome": {
				"p1": "Добро пожаловать на мой сайт! Меня зовут <b>Евгений Охватюк (псевдоним SBV)</b> и я занимаюсь веб-разработкой уже более года. Мой основной стек технологий - это React. Я стараюсь создавать веб-приложения, которые были бы красивыми, удобными в использовании и максимально эффективными.",
				"p2": "На этом сайте я представляю свои работы и эксперименты в области веб-разработки. Здесь вы можете ознакомиться с моими проектами и узнать больше о том, как я работаю.",
				"p3": "Будьте уверены, что на моем сайте не собирается никакой личной информации. Если у вас есть какие-либо вопросы, не стесняйтесь обращаться ко мне по электронной почте <b>ohvatuki@gmail.com</b> или по форме обратной связи.",
				"p4": "Спасибо за посещение моего сайта, я надеюсь, что вы найдете здесь много интересного!"
			}
		},
		"resume": {
			"title": "Резюме",
			"age": "19 лет",
			"content": {
				"p1": "Я имею среднее-специальное образование и квалификацию техника-программиста. Уже полтора года я активно занимаюсь веб-разработкой, и за это время приобрел значительный опыт в данной области.",
				"p2": "Владею <b>HTML, CSS (также препроцессор SASS) и JavaScript, включая синтаксис ES6</b>. В последние полгода занимался написанием приложений на языке <b>TypeScript</b> с использованием библиотек <b>React и Redux TK</b>. Я постоянно совершенствую свои навыки и изучаю что-то новое.",
				"p3": "Однако моя работа не ограничивается только фронтендом. Я также имею опыт работы с серверной частью приложений, используя <b>Node.js и фреймворк Express</b>. Также я знаком с <b>SQL</b>, и у меня есть опыт работы с базой данных (для своих целей использовал <b>PostgreSQL</b>).",
				"p4": "Я готов применять свои знания и навыки веб-разработки в новых проектах и продолжать свой профессиональный рост. Ищу позицию <b>Frontend разработчика</b> в компании, где смогу получить новый опыт и узнать больше о современных технологиях. С нетерпением жду возможности обсудить мою квалификацию и присоединиться к вашей команде."
			}
		},
		"feedback": {
			"title": "Связь",
			"email": "Ваш E-Mail",
			"email_placeholder": "E-Mail",
			"message": "Ваше сообщение",
			"message_placeholder": "Сообщение",
			"send": "Отправить"
		},
		"projects": {
			"title": "Проекты",
			"repo": "Репозиторий",
			"demo": "Демо",
			"page": "Страница",
			"next": "Вперед",
			"back": "Назад"
		}
	},
	"back-home": "Главная страница"
}
