{
	"version": "Версия",
	"theme": {
		"lightTheme": "Светлая тема",
		"darkTheme": "Темная тема"
	},
	"pages": {
		"home": {
			"links": {
				"home": "Главная",
				"resume": "Резюме",
				"projects": "Проекты",
				"feedback": "Связь"
			},
			"welcome": {
				"p1": "Добро пожаловать на мой сайт! Меня зовут <b>Евгений Охватюк (псевдоним SBV)</b> и я занимаюсь <b>веб-разработкой</b>. Мой основной стек технологий - это React. Я стараюсь создавать веб-приложения, которые были бы красивыми, удобными в использовании и максимально эффективными.",
				"p2": "На этом сайте я представляю свои работы и эксперименты в области веб-разработки. Здесь вы можете ознакомиться с моими проектами и узнать больше о том, как я работаю.",
				"p3": "Будьте уверены, что на моем сайте не собирается никакой личной информации. Если у вас есть какие-либо вопросы, не стесняйтесь обращаться ко мне по электронной почте <b>ohvatuki@gmail.com</b> или по форме обратной связи.",
				"p4": "Спасибо за посещение моего сайта, я надеюсь, что вы найдете здесь много интересного!"
			}
		},
		"resume": {
			"title": "Резюме",
			"name": "Евгений Охватюк",
			"career": "Frontend разработчик",
			"age": {
				"title": "Возраст",
				"value": "19 лет"
			},
			"country": {
				"title": "Страна",
				"value": "Беларусь"
			},
			"skills": "Технологии",
			"contacts": "Контакты",
			"content": {
				"common": {
					"title": "Общая информация",
					"value": "Меня зовут <b>Евгений Охватюк</b>, мне <b>19 лет</b> и последние несколько лет я занимаюсь программированием. На данный момент проживаю в <b>Беларуси</b>, где получил среднее специальное образование и квалификацию техника-программиста. Уже <b>два года</b> я активно занимаюсь <b>веб-разработкой</b> и за это время приобрел значительный опыт в данной области. Занимаюсь как версткой страниц, так и созданием приложений на базе фреймворков и библиотек."
				},
				"skills": {
					"title": "Навыки и технологии разработки",
					"value": "Свободно владею <b>HTML, CSS, препроцессором SASS</b> (верстаю в основном на флексах) и <b>JavaScript</b>, включая синтаксис ES6. В последний <b>год-полтора</b> я активно изучал <b>фреймворк React, язык TypeScript и библиотеки Redux и RTK</b> для хранения состояния приложения. Имею опыт создания пользовательских интерфейсов на основе <b>библиотеки Material UI</b>. Я постоянно совершенствую свои навыки и изучаю что-то новое.<br><br>Однако моя работа не ограничивается только фронтендом. Я также имею опыт работы с серверной частью приложений, используя <b>Node.js</b> и <b>фреймворк Express</b>. Разрабатывал REST API, что позволяло мне обмениваться данными между клиентской и серверной частями приложений. Мои знания включают работу с языком запросов <b>SQL</b>, а также опыт использования базы данных <b>PostgreSQL.</b>"
				},
				"experience": {
					"title": "Образование и опыт работы",
					"value": "В <b>2023 году</b> успешно завершил обучение в Молодечненском торгово-экономическом колледже по специальности <b>\"Программное обеспечение информационных технологий\"</b>, получив квалификацию <b>\"Техник-программист\".</b> Мое образование обеспечило расширенные знания в области разработки программного обеспечения.<br><br>На данный момент у меня <b>отсутствует коммерческий опыт</b> в веб-разработке. Моя цель — применить полученные знания и навыки на практике, а также развиваться как профессионал в области IT. В поиске позиции Frontend разработчика, я нацелен на то, чтобы внести вклад в вашу компанию, получив при этом новый опыт и углубив свои знания о современных технологиях."
				}
			}
		},
		"feedback": {
			"title": "Связь",
			"email": "Ваш E-Mail",
			"email_placeholder": "E-Mail",
			"message": "Ваше сообщение",
			"message_placeholder": "Сообщение",
			"send": "Отправить"
		},
		"projects": {
			"title": "Проекты",
			"repo": "Репозиторий",
			"demo": "Демо",
			"page": "Страница",
			"next": "Вперед",
			"back": "Назад"
		}
	},
	"back-home": "Главная страница"
}
